#!/usr/bin/env python3
import secrets
import string
import hashlib
import hmac
import subprocess

MAX_INDEX = 2147483647

# Character pools to be used later for adding noise to the custom path index - obfuscation

EXTRA_UNIQUE_EMOJIS = (
    '🧿🪩🪽🫀🫁🫦🫅🐍💻🛜🇸🇨🇷🇪🇷🇴🇷🇸🇷🇺🇷🇼🇸🇦🇸🇧🇸🇻🇸🇾🇺🇳🇿🇦🇾🇪🇺🇬🇺🇦🇹🇲🇹🇨🇽🇰🇼🇸🇼🇫🇻🇳🇭🇹🇺🇸🇺🇾🇹🇼🇹🇹🇹🇨🇹🇨🎺🎷플루мары🧶드럼롱🎙️🎛️슬라이더🐦‍⬛🦜🐦🦧🦍🐒🦨🦡🦔🐓🦦🐳🪼🐙🦑🦀 🦞🦐🐡🐠🐚🐌🐞🐝🪰蟑螂蚊子病毒蠕虫🐛🦋蚂蚁蟋蟀🐾🍊🍑🍉🌶️🍅🍎🍒🍓🥕🥭🫛🥒🫐🫘🌰🇹🇲🥞🥩🍗🫔🍕🥗🍡🍤🍣🦞🍬🔪🛟🇹🇳🇹🇴🇺🇬🇸🇲🇸🇪'
    '🫧🫷🫸🪽🦫🦦🦥🦣🦬𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏'
    '🜁🜂🜃🜄🜅🜆🜇🜈🜉🜊🜋🜌🜍🜎🜏🜐🜑🜒🜓🜔🜕🜖🜗🜘🜙🜚🜛🜜🜝🜞'
)

INVISIBLES = [
    '\u200b', '\u200c', '\u200d', '\u2060', '\u2061', '\u2062', '\u2063',
    '\u2064', '\ufeff', '\u180e', '\u00ad', '\u034f', '\u061c',
    '\u115f', '\u1160', '\u17b4', '\u17b5', '\u3164',
    '\u200e', '\u200f', '\u202a', '\u202b', '\u202c', '\u202d', '\u202e',
]

SPACES = [' ', '  ', '   ', '\t', '\u00a0', '\u2000', '\u2001', '\u2002',
          '\u2003', '\u2004', '\u2005', '\u2006', '\u2007', '\u2008',
          '\u2009', '\u200a', '\u202f', '\u205f']

EMOJI_POOL = (
    '🎉🚀🌈🍕🌟🐶🐱🏠📚💻🎊🍔🐻🎤sneeze🌪熊猫电影棕榈海滩鸡车跳舞向日葵猪礼物手机 自行车青蛙'
    '🌺公园戏剧薯条握手雏菊马玫瑰龙电影电视西装玉米奖杯靶子施工流星鲸鱼南瓜拉面疯狂门火山鲸鱼圣诞巧克力安静香烟银河鱼'
    '圣诞老人棒棒糖流口水禁烟地球海豚烟花汤说谎旗帜时钟龙控制台竹子风铃墨镜蛛网多云青蛙摩天轮毕业游戏手柄下雨仓鼠过山车勋章兴奋厕所太阳兔子'
    '竹子淋浴狼钓鱼怀疑鼻子电影院安静风拥抱胡子盆栽派对亲吻病毒热老虎老虎玫瑰融化攀爬僵尸鸟火水雪电月亮星'
)

SCRIPTS = (
    'عربيአማርኛქართულიΕλληνικάગુજરાતીעבריתहिंदी日本語ಕನ್ನಡҚазақша'
    'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    'αβγδεζηθικλμνξοπρστυφχψωΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ'
    'ℵθΩψΔкѲζσxw۝۞¶§†‡•€¥£¢°™®©√π∫∆∇≠≤≥±×÷≈∞'
    'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん'
    'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン'
    '一二三四五六七八九十百千万亿ワヤ二ヴヶ'
    'אבגדהוזחטיכלמנסעפצקרשת'
)

BANNED = {'/', '\\', '"', "'"}
SAFE_PUNCT = ''.join(c for c in string.punctuation if c not in BANNED)
ASCII_NOISE = string.ascii_letters + string.digits + SAFE_PUNCT

print("constants and character pools loaded")
