#!/usr/bin/env python3
import secrets
import string
import hashlib
import hmac
import subprocess

MAX_INDEX = 2147483647

# Character pools to be used later for adding noise to the custom path index - obfuscation

EXTRA_UNIQUE_EMOJIS = (
    '🧿🪩🪽🫀🫁🫦🫅🐍💻🛜🇸🇨🇷🇪🇷🇴🇷🇸🇷🇺🇷🇼🇸🇦🇸🇧🇸🇻🇸🇾🇺🇳🇿🇦🇾🇪🇺🇬🇺🇦🇹🇲🇹🇨🏴󠁧󠁢󠁳󠁣󠁴󠁿🏴󠁧󠁢󠁷󠁬󠁳󠁿🇽🇰🇼🇸🇼🇫🇻🇳🇭🇹🇺🇸🇺🇾🇹🇼🇹🇹🇹🇨🇹🇨🎺🎷🧶🎙️🎛️🐦‍⬛🦜🐦🦧🦍🐒🦨🦡🦔🐓🦦🐳🪼🐙🦑🦀🦞🦐🐡🐠🐚🐌🐞🐝🪰🐛🦋🐾🍊🍑🍉🌶️🍅🍎🍒🍓🥕🥭🫛🥒🫐🫘🌰🇹🇲🥞🥩🍗🫔🍕🥗🍡🍤🍣🦞🍬🔪🛟🇹🇳🇹🇴🇺🇬🇸🇲🇸🇪'
    '🫧🫷🫸🪽🦫🦦🦥🦣🦬𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏'
    '🜁🜂🜃🜄🜅🜆🜇🜈🜉🜊🜋🜌🜍🜎🜏🜐🜑🜒🜓🜔🜕🜖🜗🜘🜙🜚🜛🜜🜝🜞'
)

INVISIBLES = [
    '\u200b', '\u200c', '\u200d', '\u2060', '\u2061', '\u2062', '\u2063',
    '\u2064', '\ufeff', '\u180e', '\u00ad', '\u034f', '\u061c',
    '\u115f', '\u1160', '\u17b4', '\u17b5', '\u3164',
    '\u200e', '\u200f', '\u202a', '\u202b', '\u202c', '\u202d', '\u202e',
]

SPACES = [' ', '  ', '   ', '\t', '\u00a0', '\u2000', '\u2001', '\u2002',
          '\u2003', '\u2004', '\u2005', '\u2006', '\u2007', '\u2008',
          '\u2009', '\u200a', '\u202f', '\u205f']

EMOJI_POOL = (
    '🎉🚀🌈🍕🌟🐶🐱🏠📚💻🎊🍔🐻🎤🌪🐼🎥🌴🏖️🐔🚗💃🕺🌻🐷🎁📱🚲🐸'
    '🌺🏞️🎭🍟🤝🌼🐴🌹🐲🎬📺🕴️🌽🏆🎯🚧🌠🐳🎃🍜🤪🚪🌋🐋🎄🍫🤫🚬🌌🐟'
    '🎅🍭🤤🚭🌍🐬🎆🍲🤥🎌🕰️🐉🎛🎍🎐🕶️🕸️🌦🐸🎡🎓🕹️🌧🐹🎢🎖🤩🚾🌞🐰'
    '🎋🚿🐺🎣🤨🐽🎦🤫🌬💨🫂🧔🪴🥳😘🦠🥵🐯🐅🌹🫠🧗🧟🐦🔥💧❄️⚡🌙⭐'
)

SCRIPTS = (
    'عربيአማርኛქართულიΕλληνικάગુજરાતીעבריתहिंदी日本語ಕನ್ನಡҚазақша'
    'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    'αβγδεζηθικλμνξοπρστυφχψωΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ'
    'ℵθΩψΔкѲζσxw۝۞¶§†‡•€¥£¢°™®©√π∫∆∇≠≤≥±×÷≈∞'
    'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん'
    'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン'
    '一二三四五六七八九十百千万亿ワヤ二ヴヶ'
    'אבגדהוזחטיכלמנסעפצקרשת'
)

BANNED = {'/', '\\', '"', "'"}
SAFE_PUNCT = ''.join(c for c in string.punctuation if c not in BANNED)
ASCII_NOISE = string.ascii_letters + string.digits + SAFE_PUNCT

print("constants and character pools loaded")
