# ====================== custompath/config.py ======================
MAX_INDEX = 2147483647

EXTRA_UNIQUE_EMOJIS = (
    '🧿🪩🪽🫀🫁🫦🫅🐍💻🛜🇸🇨🇷🇪🇷🇴🇷🇸🇷🇺🇷🇼🇸🇦🇸🇧🇸🇻🇸🇾🇺🇳🇿🇦🇾🇪🇽🇰🇼🇸🇼🇫🇻🇳🇭🇹🇺🇸🇺🇾🇹🇼🇹🇹🇹🇨🇹🇨🎺🎷🧶🎙️🎛️🐦⬛🦜🐦🦧🦍🐒🦨🦡🦔🐓🦦🐳🪼🐙🦑🦀🦞🦐🐡🐠🐚🐌🐞🐝🪰🐛🦋🐾🍊🍑🍉🌶️🍅🍎🍒🍓🥕🥭🫛🥒🫐🫘🌰🇹🇲🥞🥩🍗🫔🍕🥗🍡🍤🍣🦞🍬🔪🛟🇹🇳🇹🇴🇺🇬🇸🇲🇸🇪'
    '🫧🫷🫸🪽🦫🦦🦥🦣🦬𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏'
    '🜁🜂🜃🜄🜅🜆🜇🜈🜉🜊🜋🜌🜍🜎🜏🜐🜑🜒🜓🜔🜕🜖🜗🜘🜙🜚🜛🜜🜝🜞'
)

INVISIBLES = [
    '\u200b', '\u200c', '\u200d', '\u2060', '\u2061', '\u2062', '\u2063',
    '\u2064', '\ufeff', '\u00ad'
]

SPACES = [' ', '  ', '\t', '\u00a0', '\u2000', '\u2001', '\u2002', '\u2003']

EMOJI_POOL = (
    '🎉🚀🌈🍕🌟🐶🐱🏠📚💻🎊🍔🐻🎤🌪🐼🌴🐔🚗🌻🐷🎁📱🚲🐸🌺🎭🍟🌼🐴🌹🌽🏆🎯🐳🎃🐋🎄🌍🐬🎆'
)

SCRIPTS = (
    'عربيአማርኛქართულიΕλληνικάગુજરાતીעבריתहिंदी日本語ಕನ್ನಡ'
    'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩабвгдежзийклмнопрстуфхцчшщ'
    'αβγδεζηθικλμνξοπρστυφχψω'
)

BANNED_CHARS = {'/', '\\', '"', "'"}