# .........pools.py..........
inviSible_70 = ["​", "‌", "‍", "⁠", "﻿", "ㅤ", "⠀", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", "　", "ᅟ", "ᅠ", "᠎", "؜", "؝", "؞", "؟", "­", "‑", "‒", "–", "—", "―", "‖", "‗", "‘", "’", "‚", "‛", "“", "”", "„", "‟", "†", "‡", "•", "‣", "․", "‥", "…", "‧", " ", " ", "‪", "‫", "‬", "‭", "‮", " ", "⁤", "⁥", "⁡", "⁢", "⁣", "⁤", "⁪", "⁫", "⁬", "⁭", "⁮", "⁯"]

EXTRA_UNIQUE_EMOJIS = [
    '🧿🪩🪽🫀🫁🫦🫅🐍💻🛜🪩🪽🫀🫁🫦🫅🐍💻🛜🎺🎷🎺🎷🧶🎙️🎛️🐦⬛🦜🐦🦧🦍🐒🦨🦡🦔🐓🦦🐳🪼🐙🎉🚀🌈🍕🌟🐶🐱🏠📚💻🎊🍔🐻🎤🌪🐼🌴🐔🚗🌻🐷🎁📱🚲🐸🌺🎭🍟🌼🐴🌹🌽🏆🎯🐳🎃🐋🎄🌍🐬🎆🦑🦀🦞🦐🐡🐠🐚🐌🐞🐝🪰🐛🦋🐾🍊🍑🍉🌶️🍅🍎🍒🍓🥕🥭🫛🥒🫐🫘🌰🥞🥩🍗🫔🍕🥗🍡🍤🍣🦞🍬🔪🛟'
    '🫧🫷🫸🪽🦫🦦🦥🦣🦬𓀀𓀁𓀂𓀃𓀄𓀅𓀆𓀇𓀈𓀉𓀊𓀋𓀌𓀍𓀎𓀏'
    '🜁🜂🜃🜄🜅🜆🜇🜈🜉🜊🜋🜌🜍🜎🜏🜐🜑🜒🜓🜔🜕🜖🜗🜘🜙🜚🜛🜜🜝🜞'
]

INVISIBLES = [
    '\u200b', '\u200c', '\u200d', '\u2060', '\u2061', '\u2062', '\u2063',
    '\u2064', '\ufeff', '\u180e', '\u00ad', '\u034f', '\u061c',
    '\u115f', '\u1160', '\u17b4', '\u17b5', '\u3164',
    '\u200e', '\u200f', '\u202a', '\u202b', '\u202c', '\u202d', '\u202e',
]

SPACES = [' ', '  ', '   ', '\t', '\u00a0', '\u2000', '\u2001', '\u2002',
          '\u2003', '\u2004', '\u2005', '\u2006', '\u2007', '\u2008',
          '\u2009', '\u200a', '\u202f', '\u205f']

# EMOJI_POOL = [''] - duplicate discovered 

SCRIPTS = [
    'عربيአማርኛქართულიΕλληνικάગુજરાતીעבריתहिंदी日本語ಕನ್ನಡҚазақша'
    'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    'αβγδεζηθικλμνξοπρστυφχψωΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ'
    'ℵθΩψΔкѲζσxw۝۞¶§†‡•€¥£¢°™®©√π∫∆∇≠≤≥±×÷≈∞'
    'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん'
    'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン'
    '一二三四五六七八九十百千万亿ワヤ二ヴヶ'
    'אבגדהוזחטיכלמנסעפצקרשת'
]

#SET B. ==== Building up new set of split scripts & emoji noises ====

SAFE_EMOJIS = [
    "🦮", "🦎", "🥰", "🔒", "🛡️", "✨", "💎", "🌟", "🔥", "⚡",
    "🌿", "🍀", "🌈", "🎯", "🧩", "🔑", "🪙", "🌀", "🌌", "🪐",
    "🦊", "🐺", "🦅", "🐉", "🦄", "🦋", "🐝", "🐢", "🐙", "🦈",
    "🧿", "🪩", "🪽", "🫀", "🫁", "🫦", "🫅", "🐍", "💻", "🛜",
    "😼", "🤮", "🤹", "😅", "🏌️", "🍗", "🌲", "🤿", "🚵", "🌬️",
    "📭", "🫤", "🩸", "🐔", "🚂", "😇", "💦", "🗺️", "🐝", "🌾",
    "🍚", "🧏", "🏤", "👊", "🚚", "🦎", "😎", "🌘", "🚗", "🍰",
    "🫀", "☠️", "🔫", "🙍", "🤼", "💚", "🧑‍🍼", "🦐", "🐕", "🚬",
    "🤑", "🧻", "☹️", "🌹", "🏣", "🦒", "🤝", "🌀", "♠️", "🐞",
    "🥞", "🥦", "🎵", "⛏️", "🫔", "🎷", "🌧️", "🌎", "🥕", "🚝",
    "👈", "🥴", "👴", "🏭", "🐨", "🏠", "🍩", "⏲️", "🥸", "👁️",
    "🍒", "😜", "🪙", "🪴", "🤤", "🐀", "🤖", "🎢", "⚱️", "🤬",
    "🧯", "🌅", "⚾", "⛷️", "👣", "🚙", "🚐", "🀄", "🦠", "🔏",
    "🥈", "📻", "🪧", "🔗", "⛲", "💞", "🔨", "🫣", "👩", "👆",
    "🦓", "💽", "🎂", "📷", "🌽", "🤏", "🛻", "📀", "🧾", "😰",
    "🪣", "🍪", "🍭", "😢", "💸", "🦍", "👺", "🦁", "🐬", "🌟",
    "🥙", "🕍", "🦈", "🚿", "🎶", "📅", "🎭", "👼", "🛠️", "🎾",
    "🫑", "🐽", "🌦️", "👄", "📸", "🍯", "📔", "💬", "🐹", "👭",
    "🍦", "🤩", "🐡", "🚛", "🍫", "🪆", "💉", "👅", "🐸", "🌃",
    "💗", "🏛️", "🏰", "💘", "😣", "😗", "🦻", "🪶", "🏐", "🛕",
    "🍲", "🐎", "📕", "💋", "👪", "♟️", "🦛", "🕵️", "🐟", "🐆",
    "🪠", "🏙️", "💃", "😁", "🗼", "🥯", "🗒️", "🧰", "💔", "👰",
    "🐶", "⭐", "💀", "🥵", "🛫", "🍎", "⛱️", "🗓️", "💄", "😝",
    "🧼", "🍑", "🥨", "📒", "🥒", "🥚", "🍨", "🤔", "🏥", "🌠",
    "🌈", "💌", "🏅", "🏪", "🎣", "🫓", "🦞", "🧛", "🌇", "💪",
    "🗡️", "🍶", "😾", "🐵", "🧹", "🦏", "🦖", "🏆", "🔮", "😱",
    "🎚️", "🌋", "👏", "🛵", "📤", "🔖", "🐥", "🌩️", "📂", "🌓",
    "⛹️", "👹", "🔥", "🫖", "🎖️", "🧭", "🕹️", "📃", "🏏", "🐱",
    "🍠", "⛓️", "📌", "🤶", "🍋", "😤", "👷", "🎓", "☁️", "🦇",
    "🙆", "💭", "🛡️", "💏", "📇", "👨", "🙋", "🌺", "🐤", "📮",
    "🦼", "🐗", "🫐", "☃️", "🍍", "🤛", "🌖", "🛖", "🤒", "🏋️",
    "🦙", "🪑", "♨️", "🥉", "👬", "🌕", "🦷", "🙎", "🍓", "🏓",
    "😽", "♥️", "🖊️", "🙁", "🎀", "😓", "📓", "🚪", "🖐️", "🌒",
    "🧕", "🍾", "📨", "🤌", "👠", "🖲️", "🧘", "🖋️", "🏮", "🍌",
    "💑", "🥺", "🐘", "💇", "🥂", "👋", "🦆", "🥘", "🌙", "🪵",
    "💢", "💡", "🫒", "🏡", "🫵", "🤣", "🛞", "🛥️", "🌔", "🎥",
    "🐊", "🎍", "🖨️", "🏫", "🏦", "🎅", "💵", "🎏", "🍅", "🦔",
    "🤳", "🌨️", "🎒", "🥪", "🤰", "🍘", "🤴", "👯", "🚓", "📊",
    "😂", "🎩", "🎃", "🍷", "📍", "🔒", "🐷", "⛴️", "😿", "🎗️", "🔑", "☔", "🎮", "💥", "💍", "🐂",
    "😭", "🍵", "🍺", "😛", "🌁", "🍡", "😞", "😕", "🐑", "🦩",
    "🗻", "🏬", "🐠", "🥓", "🗞️", "👀", "😚", "🎈", "🥋", "⚰️",
    "🚶", "🖼️", "🌞", "🌉", "🕰️", "🍸", "👮", "🤸", "👩‍🍼", "🚤",
    "🐅", "🏊", "🛷", "🥃", "🌍", "🧞", "🤺", "👸", "📏", "🥊",
    "🗾", "🤷", "🧆", "🚔", "🤫", "🕯️", "🙌", "🦥", "🍤", "👌",
    "🦃", "🐴", "🖍️", "🔓", "🎟️", "🎙️", "🧠", "🗄️", "🐫", "🕌",
    "🦢", "💺", "💜", "💯", "🪟", "📁", "😩", "🚉", "⌚", "🪥",
    "📬", "🎿", "🦉", "💧", "🤦", "🪅", "🛩️", "📐", "🖱️", "💷",
    "🧑", "🪡", "🪗", "😘", "🪞", "🃏", "🦫", "🏇", "🥌", "🤱",
    "🚣", "😯", "🪷", "🫡", "🧓", "📡", "💒", "🌯", "🎴", "😍",
    "🦽", "🔍", "🗳️", "🐏", "👵", "❤️", "⛳", "🏗️", "💩", "🏈",
    "🖕", "🧜", "🤍", "🏘️", "😮", "🚑", "📟", "🌚", "📄", "🦨",
    "🧪", "🏃", "🦹", "👜", "🍐", "🗝️", "🍢", "🦗", "🫢", "💤",
    "🛳️", "💰", "⚙️", "🐮", "🎉", "🪔", "😀", "🚒", "⏳", "🎫",
    "🏜️", "⚡", "💟", "🧟", "🫗", "🫶", "🍙", "🗽", "☀️", "📰",
    "💻", "💙", "👧", "⛄", "🦌", "🍽️", "📫", "🎱", "🍞", "🐛",
    "🧶", "🌪️", "🚀", "🚇", "🦿", "🥟", "👶", "☝️", "🕷️", "💆",
    "🌸", "✌️", "🏢", "🥷", "🍹", "🖖", "⛸️", "📧", "🦵", "✊",
    "🌮", "💣", "🌆", "💁", "🪂", "🍿", "🧄", "💅", "🛶", "😵",
    "🐯", "🧝", "🥍", "📞", "🐜", "✋", "⌨️", "🤟", "🍏", "🚞",
    "💫", "🙇", "🪢", "🌶️", "☕", "🍈", "👕", "🧐", "⌛", "🔐",
    "🐄", "🤞", "🧮", "🥗", "🥇", "📎", "🎲", "🐿️", "💴", "🏍️",
    "✒️", "🥀", "😸", "🥭", "✉️", "🌫️", "🐢", "🤓", "🏚️", "🥥",
    "🤙", "🏷️", "🐃", "🦧", "🌐", "🍱", "✏️", "🥫", "✈️", "🍖",
    "👫", "🤠", "🎪", "💶", "🏒", "🌌", "🌝", "🥄", "📆", "⛅",
    "🏄", "🥜", "📼", "😪", "🚅", "🔭", "💛", "🏸", "🚌", "🚃",
    "☎️", "🖤", "🥤", "🐌", "🦪", "🏩", "💓", "🧊", "🌂", "📝",
    "🪜", "🧧", "🎹", "🐋", "🥐", "😄", "🏝️", "🌜", "🏔️", "🍜",
    "😫", "📚", "🌥️", "🦾", "🐒", "🦘", "🚕", "🚜", "⛈️", "🥝",
    "☘️", "🎨", "🐇", "👤", "🛬", "👳", "📦", "⚗️", "🤯", "🪰",
    "🍟", "👇", "🦑", "🧱", "🧂", "🍝", "✍️", "🌡️", "😈", "📩",
    "🦚", "⛵", "🎤", "🥲", "🚢", "😦", "✂️", "⏱️", "🐁", "🧩",
    "🧲", "🥩", "🏑", "😹", "🍮", "🚁", "🫃", "🧈", "🧉", "🍀",
    "🎞️", "🏂", "🕴️", "💂", "🦬", "🤎", "🥅", "🧇", "🎯", "👖",
    "🙃", "🦜", "🧅", "🤭", "☂️", "🎎", "😻", "🍻", "📗", "🌄",
    "😙", "🎺", "🪳", "👃", "👲", "📱", "📑", "🙈", "🏯", "☄️",
    "🦦", "📖", "🩺", "👾", "❄️", "🚋", "🔩", "💝", "🛺", "🧀",
    "🐓", "🔋", "🤵", "🧙", "🦴", "🔌", "👂", "🌏", "🚘", "🚲",
    "🧔", "🛏️", "🍛", "💊", "🚨", "🚎", "🏨", "🍼", "🦄", "🐳",
    "🕋", "🪒", "🫰", "🔎", "🚆", "👉", "📙", "🛍️", "😳", "🦯",
    "🌻", "🐺", "📘", "🤽", "🏟️", "🌊", "🍣", "🤗", "🍉", "🪘",
    "🎻", "🙀", "🚈", "🚊", "🕺", "🫅", "🧨", "🏉", "😆", "📈",
    "🚖", "🎡", "🐻", "📉", "🍥", "🏀", "🥳", "💕", "🧗", "🏖️",
    "🧋", "🍳", "🥑", "💎", "🐼", "🎐", "🙏", "🙂", "🌰", "🙅",
    "🧵", "🧎", "🙊", "💐", "🌷", "🗂️", "😉", "👦", "👻", "🧒",
    "🐣", "🌤️", "📿", "🥏", "📋", "🐪", "🥖", "🌭", "😥", "🌛",
    "🥬", "🔪", "⚒️", "👨‍🍼", "⛰️", "🤚", "🛌", "🌵", "🦝", "📹",
    "🧃", "👐", "🥔", "🤢", "🎠", "📠", "🛝", "❣️", "🎳", "🧫",
    "🧬", "👍🏻", "👍🏼", "👍🏽", "👍🏾", "👍🏿", "👎🏻", "👎🏼", "👎🏽", "👎🏾", "👎🏿",
    "👊🏻", "👊🏼", "👊🏽", "👊🏾", "👊🏿", "✊🏻", "✊🏼", "✊🏽", "✊🏾", "✊🏿",
    "🤛🏻", "🤛🏼", "🤛🏽", "🤛🏾", "🤛🏿", "🤜🏻", "🤜🏼", "🤜🏽", "🤜🏾", "🤜🏿",
    "🤞🏻", "🤞🏼", "🤞🏽", "🤞🏾", "🤞🏿", "✌️🏻", "✌️🏼", "✌️🏽", "✌️🏾", "✌️🏿",
    "🤟🏻", "👋🏻", "👋🏼", "👋🏽", "👋🏾", "👋🏿",
    "💪🏻", "💪🏼", "💪🏽", "💪🏾", "💪🏿", "🙏🏻", "🙏🏼", "🙏🏽", "🙏🏾", "🙏🏿",
    "✍️🏻", "✍️🏼", "✍️🏽", "✍️🏾", "✍️🏿", "💅🏻", "💅🏼", "💅🏽", "💅🏾", "💅🏿",
    "🤳🏻", "🤳🏼", "🤳🏽", "🤳🏾", "🤳🏿", "👶🏻", "👶🏼", "👶🏽", "👶🏾", "👶🏿",
    "🧒🏻", "🧒🏼", "🧒🏽", "🧒🏾", "🧒🏿", "👦🏻", "👦🏼", "👦🏽", "👦🏾", "👦🏿",
    "👧🏻", "👧🏼", "👧🏽", "👧🏾", "👧🏿", "🧑🏻", "🧑🏼", "🧑🏽", "🧑🏾", "🧑🏿",
    "👱🏻", "👱🏼", "👱🏽", "👱🏾", "👱🏿", "👨🏻", "👨🏼", "👨🏽", "👨🏾", "👨🏿",
    "👩🏻", "👩🏼", "👩🏽", "👩🏾", "👩🏿", "🧔🏻", "🧔🏼", "🧔🏽", "🧔🏾", "🧔🏿",
    "👵🏻", "👵🏼", "👵🏽", "👵🏾", "👵🏿", "👴🏻", "👴🏼", "👴🏽", "👴🏾", "👴🏿",
    "👲🏻", "👲🏼", "👲🏽", "👲🏾", "👲🏿", "👳🏻", "👳🏼", "👳🏽", "👳🏾", "👳🏿",
    "🧕🏻", "🧕🏼", "🧕🏽", "🧕🏾", "🧕🏿", "👮🏻", "👮🏼", "👮🏽", "👮🏾", "👮🏿",
    "👷🏻", "👷🏼", "👷🏽", "👷🏾", "👷🏿", "💂🏻", "💂🏼", "💂🏽", "💂🏾", "💂🏿",
    "🕵️🏻", "🕵️🏼", "🕵️🏽", "🕵️🏾", "🕵️🏿", "👩🏻‍⚕️", "👩🏼‍⚕️", "👩🏽‍⚕️", "👩🏾‍⚕️", "👩🏿‍⚕️",
    "👨🏻‍⚕️", "👨🏼‍⚕️", "👨🏽‍⚕️", "👨🏾‍⚕️", "👨🏿‍⚕️", "👩🏻‍🎓", "👩🏼‍🎓", "👩🏽‍🎓", "👩🏾‍🎓", "👩🏿‍🎓",
    "👨🏻‍🎓", "👨🏼‍🎓", "👨🏽‍🎓", "👨🏾‍🎓", "👨🏿‍🎓", "👩🏻‍🏫", "👩🏼‍🏫", "👩🏽‍🏫", "👩🏾‍🏫", "👩🏿‍🏫",
    "👨🏻‍🏫", "👨🏼‍🏫", "👨🏽‍🏫", "👨🏾‍🏫", "👨🏿‍🏫", "👩🏻‍⚖️", "👩🏼‍⚖️", "👩🏽‍⚖️", "👩🏾‍⚖️", "👩🏿‍⚖️",
    "👨🏻‍⚖️", "👨🏼‍⚖️", "👨🏽‍⚖️", "👨🏾‍⚖️", "👨🏿‍⚖️", "👩🏻‍🌾", "👩🏼‍🌾", "👩🏽‍🌾", "👩🏾‍🌾", "👩🏿‍🌾",
    "👨🏻‍🌾", "👨🏼‍🌾", "👨🏽‍🌾", "👨🏾‍🌾", "👨🏿‍🌾", "👩🏻‍🍳", "👩🏼‍🍳", "👩🏽‍🍳", "👩🏾‍🍳", "👩🏿‍🍳",
    "👨🏻‍🍳", "👨🏼‍🍳", "👨🏽‍🍳", "👨🏾‍🍳", "👨🏿‍🍳", "👩🏻‍🔧", "👩🏼‍🔧", "👩🏽‍🔧", "👩🏾‍🔧", "👩🏿‍🔧",
    "👨🏻‍🔧", "👨🏼‍🔧", "👨🏽‍🔧", "👨🏾‍🔧", "👨🏿‍🔧", "👩🏻‍🏭", "👩🏼‍🏭", "👩🏽‍🏭", "👩🏾‍🏭", "👩🏿‍🏭",
    "👨🏻‍🏭", "👨🏼‍🏭", "👨🏽‍🏭", "👨🏾‍🏭", "👨🏿‍🏭", "👩🏻‍💼", "👩🏼‍💼", "👩🏽‍💼", "👩🏾‍💼", "👩🏿‍💼",
    "👨🏻‍💼", "👨🏼‍💼", "👨🏽‍💼", "👨🏾‍💼", "👨🏿‍💼", "👩🏻‍🔬", "👩🏼‍🔬", "👩🏽‍🔬", "👩🏾‍🔬", "👩🏿‍🔬",
    "👨🏻‍🔬", "👨🏼‍🔬", "👨🏽‍🔬", "👨🏾‍🔬", "👨🏿‍🔬", "👩🏻‍💻", "👩🏼‍💻", "👩🏽‍💻", "👩🏾‍💻", "👩🏿‍💻",
    "👨🏻‍💻", "👨🏼‍💻", "👨🏽‍💻", "👨🏾‍💻", "👨🏿‍💻", "👩🏻‍🎤", "👩🏼‍🎤", "👩🏽‍🎤", "👩🏾‍🎤", "👩🏿‍🎤",
    "👨🏻‍🎤", "👨🏼‍🎤", "👨🏽‍🎤", "👨🏾‍🎤", "👨🏿‍🎤", "👩🏻‍🎨", "👩🏼‍🎨", "👩🏽‍🎨", "👩🏾‍🎨", "👩🏿‍🎨",
    "👨🏻‍🎨", "👨🏼‍🎨", "👨🏽‍🎨", "👨🏾‍🎨", "👨🏿‍🎨", "👩🏻‍✈️", "👩🏼‍✈️", "👩🏽‍✈️", "👩🏾‍✈️", "👩🏿‍✈️",
    "👨🏻‍✈️", "👨🏼‍✈️", "👨🏽‍✈️", "👨🏾‍✈️", "👨🏿‍✈️", "👩🏻‍🚀", "👩🏼‍🚀", "👩🏽‍🚀", "👩🏾‍🚀", "👩🏿‍🚀",
    "👨🏻‍🚀", "👨🏼‍🚀", "👨🏽‍🚀", "👨🏾‍🚀", "👨🏿‍🚀", "👩🏻‍🚒", "👩🏼‍🚒", "👩🏽‍🚒", "👩🏾‍🚒", "👩🏿‍🚒",
    "👨🏻‍🚒", "👨🏼‍🚒", "👨🏽‍🚒", "👨🏾‍🚒", "👨🏿‍🚒", "🫃🏻", "🫃🏼", "🫃🏽", "🫃🏾", "🫃🏿",
    "🫄🏻", "🫄🏼", "🫄🏽", "🫄🏾", "🫄🏿", "🤰🏻", "🤰🏼", "🤰🏽", "🤰🏾", "🤰🏿",
    "🤱🏻", "🤱🏼", "🤱🏽", "🤱🏾", "🤱🏿", "👼🏻", "👼🏼", "👼🏽", "👼🏾", "👼🏿",
    "🎅🏻", "🎅🏼", "🎅🏽", "🎅🏾", "🎅🏿", "🤶🏻", "🤶🏼", "🤶🏽", "🤶🏾", "🤶🏿",
    "🦸🏻", "🦸🏼", "🦸🏽", "🦸🏾", "🦸🏿", "🦹🏻", "🦹🏼", "🦹🏽", "🦹🏾", "🦹🏿",
    "🧙🏻", "🧙🏼", "🧙🏽", "🧙🏾", "🧙🏿", "🧚🏻", "🧚🏼", "🧚🏽", "🧚🏾", "🧚🏿",
    "🧛🏻", "🧛🏼", "🧛🏽", "🧛🏾", "🧛🏿", "🧜🏻", "🧜🏼", "🧜🏽", "🧜🏾", "🧜🏿",
    "🧝🏻", "🧝🏼", "🧝🏽", "🧝🏾", "🧝🏿", "🧞🏻", "🧞🏼", "🧞🏽", "🧞🏾", "🧞🏿",
    "🧟🏻", "🧟🏼", "🧟🏽", "🧟🏾", "🧟🏿", "💆🏻", "💆🏼", "💆🏽", "💆🏾", "💆🏿",
    "💇🏻", "💇🏼", "💇🏽", "💇🏾", "💇🏿", "🚶🏻", "🚶🏼", "🚶🏽", "🚶🏾", "🚶🏿",
    "🧍🏻", "🧍🏼", "🧍🏽", "🧍🏾", "🧍🏿", "🧎🏻", "🧎🏼", "🧎🏽", "🧎🏾", "🧎🏿",
    "🏃🏻", "🏃🏼", "🏃🏽", "🏃🏾", "🏃🏿", "💃🏻", "💃🏼", "💃🏽", "💃🏾", "💃🏿",
    "🕺🏻", "🕺🏼", "🕺🏽", "🕺🏾", "🕺🏿", "🕴️🏻", "🕴️🏼", "🕴️🏽", "🕴️🏾", "🕴️🏿",
    "👯🏻", "👯🏼", "👯🏽", "👯🏾", "🏇🏼", "🏇🏽", "🏇🏾", "🏇🏿", "⛷️🏻", "⛷️🏼", "⛷️🏽", "⛷️🏾", "⛷️🏿",
    "🏂🏻", "🏂🏼", "🏂🏽", "🏂🏾", "🏂🏿", "🏌️🏻", "🏌️🏼", "🏌️🏽", "🏌️🏾", "🏌️🏿",
    "🏄🏻", "🏄🏼", "🏄🏽", "🏄🏾", "🏄🏿", "🚣🏻", "🚣🏼", "🚣🏽", "🚣🏾", "🚣🏿",
    "🏊🏻", "🏊🏼", "🏊🏽", "🏊🏾", "🏊🏿", "⛹️🏻", "⛹️🏼", "⛹️🏽", "⛹️🏾", "⛹️🏿",
    "🏋️🏻", "🏋️🏼", "🏋️🏽", "🏋️🏾", "🏋️🏿", "🚴🏻", "🚴🏼", "🚴🏽", "🚴🏾", "🚴🏿",
    "🚵🏻", "🚵🏼", "🚵🏽", "🚵🏾", "🚵🏿", "🤸🏻", "🤸🏼", "🤸🏽", "🤸🏾", "🤸🏿",
    "🤼🏻", "🤼🏼", "🤼🏽", "🤼🏾", "🤼🏿", "🤽🏻", "🤽🏼", "🤽🏽", "🤽🏾", "🤽🏿",
    "🤾🏻", "🤾🏼", "🤾🏽", "🤾🏾", "🤾🏿", "🤹🏻", "🤹🏼", "🤹🏽", "🤹🏾", "🤹🏿",
    "🧘🏻", "🧘🏼", "🧘🏽", "🧘🏾", "🧘🏿", "🇦🇫", "🇦🇱", "🇩🇿", "🇦🇸", "🇦🇩",
    "🇦🇴", "🇦🇮", "🇦🇶", "🇦🇬", "🇦🇷", "🇦🇲", "🇦🇼", "🇦🇺", "🇦🇹", "🇦🇿",
    "🇧🇸", "🇧🇭", "🇧🇩", "🇧🇧", "🇧🇾", "🇧🇪", "🇧🇿", "🇧🇯", "🇧🇲", "🇧🇹",
    "🇧🇴", "🇧🇦", "🇧🇼", "🇧🇷", "🇮🇴", "🇧🇳", "🇧🇬", "🇧🇫", "🇧🇮", "🇰🇭",
    "🇨🇲", "🇨🇦", "🇨🇻", "🇰🇾", "🇨🇫", "🇹🇩", "🇨🇱", "🇨🇳", "🇨🇽", "🇨🇨",
    "🇨🇴", "🇰🇲", "🇨🇬", "🇨🇩", "🇨🇰", "🇨🇷", "🇨🇮", "🇭🇷", "🇨🇺", "🇨🇾",
    "🇨🇿", "🇩🇰", "🇩🇯", "🇩🇲", "🇩🇴", "🇪🇨", "🇪🇬", "🇸🇻", "🇬🇶", "🇪🇷",
    "🇪🇪", "🇪🇹", "🇫🇰", "🇫🇴", "🇫🇯", "🇫🇮", "🇫🇷", "🇬🇫", "🇵🇫", "🇬🇦",
    "🇬🇲", "🇬🇪", "🇩🇪", "🇬🇭", "🇬🇮", "🇬🇷", "🇬🇱", "🇬🇩", "🇬🇵", "🇬🇺",
    "🇬🇹", "🇬🇳", "🇬🇼", "🇬🇾", "🇭🇹", "🇻🇦", "🇭🇳", "🇭🇰", "🇭🇺", "🇮🇸", "🇻🇳", "🇻🇬",
    "🇻🇮", "🇼🇫", "🇪🇭", "🇾🇪", "🇿🇲", "🇿🇼", "🫨", "🫷", "🫸", "🫎",
    "🫏", "🫠", "🫥", "🫳", "🫴", "🪿", "🪫", "🪬", "🪭", "🪮",
    "🪯", "🪱", "🪹", "🪺", "🫘", "🫙", "🫚", "🫛", "🫜", "🫟",
    "🫧", "🪸", "🪼", " ", "     ", "  ","          ", "💵", '💲', '🙏', '🤓', '🦠', '✈️', '🪂', '🧑‍🌾', "🧑‍🏫"
]

NON_ASCII_LETTERS = [
    "α", "β", "γ", "δ", "ε", "ζ", "η", "θ", "ι", "κ",
    "λ", "μ", "ν", "ξ", "ο", "π", "ρ", "σ", "τ", "υ",
    "φ", "χ", "ψ", "ω",
    "а", "б", "в", "г", "д", "е", "ж", "з", "и", "й",
    "к", "л", "м", "н", "о", "п", "р", "с", "т", "у",
    "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э",
    "ю", "я",
    "ա", "բ", "գ", "դ", "ե", "զ", "է", "ը", "թ", "ժ",
]

EMOJI_POOL = ["CD‍
AB‌ㅤ‌‍‍‍‍⁠‍ㅤ‌‍ㅤ‌⁠ㅤ‌ㅤㅤㅤ‌‍⁠‌⁠⁠‌‌‌
AB‌ㅤ‌‍‍‍‍⁠‍ㅤ‌‍ㅤ‌⁠ㅤ‌A‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌B‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌C‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌D‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌E
F‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌G‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌H‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌I‌‌‍⁠‍ㅤ⁠ㅤ‍⁠‍‌Jㅤㅤㅤ‌‍⁠‌⁠⁠‌‌‌⁠‌‌‌ㅤ‍⁠‌⁠‍ㅤㅤ⁠⁠‌‍‌‌⁠⁠‌‍ㅤ‍ㅤ‍‍‍‍ㅤㅤㅤ‍⁠‌‌ㅤ⁠⁠‌⁠ㅤㅤ⁠ㅤ‍ㅤ⁠‍‌ㅤ⁠‌‍‍ㅤㅤ⁠‌⁠ㅤ‍‍ㅤ‍‌ㅤ‌⁠ㅤ‌⁠ㅤ‌‍⁠‍⁠‍‌ㅤ‍⁠‌⁠‌ㅤ‌⁠‌‍‍⁠‌‍‌ㅤ⁠‍⁠‌‌ㅤ⁠‍⁠⁠‌ㅤ‍‍‍ㅤ‍⁠‍‍‌‌‍ㅤ‍ㅤ⁠‍ㅤ‌ㅤ‍ㅤ⁠‌‍‌‍‍‍⁠‍‌‌‍⁠⁠ㅤ  ㅤ‍ㅤㅤ‌ㅤ‌⁠ㅤㅤㅤㅤㅤ‌⁠ㅤ‌‍‍⁠ㅤㅤ‌⁠‍‌‌⁠⁠‌‍‌‍‍ㅤ‌‍ㅤㅤㅤ⁠ㅤ‍‍‍⁠⁠‌ㅤ⁠ㅤㅤㅤ‍⁠‍ㅤ‌ㅤ‍‌ㅤ⁠⁠⁠‍‍‍⁠⁠‌‍⁠‍ㅤ‍⁠‍⁠‌ㅤ⁠‍⁠‌⁠⁠‌‍ㅤㅤ⁠















































‍ㅤㅤㅤ‌ㅤ⁠⁠⁠⁠‌‌‌ㅤ‌‍‌ㅤ⁠‌⁠ㅤ⁠ㅤ⁠‌‍⁠‌‌⁠‌‌⁠‌‌‌⁠‌‌ㅤ‌⁠‌‍ㅤ⁠‌‌⁠⁠⁠ㅤ⁠‍ㅤ⁠‌‌‍‍⁠ㅤ⁠⁠‌⁠ㅤㅤ⁠⁠‍‌‍‍‌⁠⁠‍‌⁠ㅤㅤ‌‌‍⁠‌‍‍‌ㅤ‌‌‌ㅤ‍⁠⁠‌‌‌ㅤ⁠‌ㅤ⁠‍ㅤ‌‌⁠ㅤ⁠⁠‍‍⁠ㅤ‌ㅤ‌⁠ㅤㅤ‌ㅤ⁠ㅤ⁠⁠‍ㅤ‍ㅤㅤ⁠⁠⁠ㅤ‍ㅤ‍‌ㅤ⁠‍ㅤ‌⁠ㅤ⁠ㅤ⁠‍ㅤㅤㅤ‍‍‍⁠‌⁠‌‌‌⁠‌⁠‌ㅤ⁠‌‌‍‍‌‌⁠‍⁠⁠‍‍‍⁠‍ㅤ‍‌⁠ㅤㅤ‍‍⁠ㅤㅤ‍ㅤ‌ㅤㅤ⁠‍ㅤ‍‌ㅤ‍‍‌ㅤ‍‌ㅤ‌‍⁠⁠‍⁠‌ㅤ‍‌⁠ㅤ‍‌‌‍‍ㅤㅤ‌ㅤ⁠‌ㅤ‌‍ㅤ‍⁠‍‌‍⁠ㅤ‍ㅤ‌ㅤ‍⁠ㅤ‌ㅤ‌‍‌‍ㅤ⁠ㅤㅤㅤ‍‍‍‍‍ㅤ⁠‌‌‍ㅤㅤ⁠‌‌‍ㅤ‌‍ㅤ⁠‍‍‌⁠ㅤ⁠‍ㅤㅤ⁠ㅤ‌‌‍‍‍⁠‌‌⁠‍‍⁠






















‍ㅤㅤㅤ‌ㅤ⁠⁠⁠⁠‌‌‌ㅤ‌‍‌ㅤ⁠‌⁠ㅤ⁠ㅤ⁠‌‍⁠‌‌⁠‌‌⁠‌‌‌⁠‌‌ㅤ‌⁠‌‍ㅤ⁠‌‌⁠⁠⁠ㅤ⁠‍ㅤ⁠‌‌‍‍⁠ㅤ⁠⁠‌⁠ㅤㅤ⁠⁠‍‌‍‍‌⁠⁠‍‌⁠ㅤㅤ‌‌‍⁠‌‍‍‌ㅤ‌‌‌ㅤ‍⁠⁠‌‌‌ㅤ⁠‌ㅤ⁠‍ㅤ‌‌⁠ㅤ⁠⁠‍‍⁠ㅤ‌ㅤ‌⁠ㅤㅤ‌ㅤ⁠ㅤ⁠⁠‍ㅤ‍ㅤㅤ⁠⁠⁠ㅤ‍ㅤ‍‌ㅤ⁠‍ㅤ‌⁠ㅤ⁠
                                                                                                                                      RECOVERY PHRASE  PASSKEY TOKEN SESSION m⁶              HardToHackEmailAccount.YouCannotHackThis.Moody⁴⁴⁶@slmail.me   +   Nobody_Can_Hack_Me.Unguarded¹⁴⁹@aleeas.com 🖕💯🧚ㅤ‍ㅤ⁠‌‌ㅤㅤㅤ‌ ㅤ⁠⁠‍⁠‍⁠‍‍‌‌‌⁠‌‍ㅤㅤ‍‍‌ㅤ‍‍⁠⁠‌⁠ㅤ⁠‌ㅤ⁠ㅤ⁠‍⁠ㅤ‍⁠ㅤ‌‌⁠‌‌⁠ㅤ‌‍ㅤ⁠‍ㅤㅤ‌‍‍‍ㅤ‍‌ㅤㅤ⁠⁠‍⁠‍⁠ㅤ‍مين صاحي دلوقتيㅤ‍‍‍‍⁠ㅤ‌⁠ㅤ⁠⁠‌‍‍‌⁠ㅤ‌ㅤㅤ⁠‍ㅤ‍‌‌⁠‌‌⁠‍‍ㅤ‍ㅤㅤ‍‍‍⁠⁠ㅤ‌ㅤ‌‍⁠‍‌‍‌ㅤ⁠⁠⁠‍‌‍‍‌ㅤㅤ⁠⁠ㅤ‍‍⁠‌ㅤ⁠⁠ㅤ‍  ㅤ⁠‍⁠‌⁠⁠‌‍ㅤㅤ









Seedphrase passphrase private key 0x   API , apikey password 🔑              HardToHackEmailAccount.YouCannotHackThis.Moody@slmail.me      +        Nobody_Can_Hack_Me.Unguarded@aleeas.com  🎉🚀🌈🍕🌟🐶🐱🏠📚💻🎊🍔🐻🎤🌪🐼🌴🐔🚗🌻🐷🎁📱🚲🐸🌺🎭🍟🌼🐴🌹🌽🏆🎯🐳🎃🐋🎄🌍🐬🎆

♣™🦾♪🪂💯🧚ㅤ‍ㅤ⁠‌‌ㅤㅤㅤ‌ㅤ⁠⁠‍⁠‍⁠‍‍‌‌‌⁠‌‍ㅤㅤ‍‍‌ㅤ‍‍⁠⁠‌⁠ㅤ⁠‌ㅤ⁠ㅤ⁠‍⁠ㅤ‍⁠ㅤ‌‌⁠‌‌⁠ㅤ‌‍ㅤ⁠‍ㅤㅤ‌‍‍‍ㅤ‍‌ㅤㅤين ص谷^]. $³x⁹🌍⅞🌎👇👆⁹📨sy|١ภΞτϣΨмΞ      $ақшаଓଡ଼ିଆиронਪੰਜਾਬੀ   匚_૪τΛ+ᐱᑕܡܠܟܐܕܘܫܐᐃᐧᐣ` `રાજા`שלוםעליજ`រាជានិពន្ធプレル市ヶ€谷^].@i!yG Uu💯💥🤣🪴🥰🍊🧡⅘❌👋₱€₹™`²€♪🫳🫴🦿🦵🦗🐜🪼🦋🐛🐡🦤🦆🦈c0Oi    ^B!#ZsnMqngLnOMQmBVFhH#uRDO  av0AspX*S^ ⅜ રાજાשל@ZV રાજાשלוםעליજ រាជានិពន្ធプレル市ヶ€谷  ⁵हिन्दी<日本語>ಕನ್ನಡ?کشҚазақша\ខ         API Keys (sk-...), Passwords (DB_PASSWORD), .env file, Private Keys (id_rsa, *.pem), Database URL (mongodb:user:pass@host), Access Tokens (Bearer-JWT), User Data (emails-phones), Cloud Keys (AWS_SECRET) phone number +⁴⁴ email address admin password credit cards ew more: OAuth Client Secret, Webhook Secret, Encryption Salt Keys, Session Secret (JWT_SECRET), Payment Webhook Keys (Stripe), Firebase Config (private), Internal IP Addresses 

 A         GitHub - money: 
🎉🚀🌈🍕🌟🐶🐱🏠🍊🍑🍉🌶️🍅🍎🍒🍓🥕🥭🫛🥒🫐🫘🌰🇹🇲🥞🥩🍗🫔🍕🥗🍡🍤🍣🦞🍬🔪🛟🇹🇳🇹🇴🇺🇬🇸🇲🇸🇪👁️‍🗨️🎼🎵🎶🟰➰◼️◾▪️🏴🎌🏳️🏳️‍🌈🏳️‍⚧️🏴‍☠️🔘™️➖➗🆔☪️☯️🛅🚼🚼🕉️🚻🔟*️⃣🈂️🆙🆗🆒🆖🔠🔣3️⃣4️⃣🔡🔢#️⃣🈁🅿️↩️💲☣️⚠️♻️❇️〽️❎✅☢️⏸️⏬🔰❎🛜🔼📴⏮️⏏️⏪◀️⏹️⏺️🔶🦼🦽🛴🚗🛻🚙🚦🚥地铁🛵摩托车自行车⚓⚓📛♨️㊙️🉐㊗️🈴🈺🚷💭⚧️♂️🚯🚱📵🔕🔇🟧❤️🧡💙💜⚫🟤🟪🟫🕚📣🔍🔎🪦🔮🚬🧿🪤🪤📿🏺🕥🕥🕙🕛⏰🕧🕰️🕐⌚⏱️🕞🕒🕓🕛🕟🕧🕔🕐🕠🕜🕑🕕🕡🕝⏲️📅📫🗑️📍📌🔖📂📓📗📚📉🏷️🗞️📈📐⛏️🔗🪚🧰📡卫星🪣🪝🧲🛠️🔨✂️🖇️📎⛓️🔗⚙️🫎🫏🪿🪼🪸🪟🪞🪄🪅🪆🪐🪨🪵🛖🪴🫥🫤🥹🫡🥷📚💻🎊🍔🐻🎤sneeze🌪熊猫电影棕榈海滩鸡车跳舞向日葵猪礼物手机自行车青蛙'
    '🌺公园戏剧薯条握手雏菊马玫瑰龙电影电视西装玉米奖杯靶子施工流星鲸鱼南瓜拉面疯狂门火山鲸鱼圣诞巧克力安静香烟银河鱼'
    '圣诞老人棒棒糖流口水禁烟地球海豚烟花汤说谎旗帜时钟龙控制台竹子风铃墨镜蛛网多云青蛙摩天轮毕业游戏手柄下雨仓鼠过山车勋章兴奋厕所太阳兔子'
    '竹子淋浴狼钓鱼怀疑鼻子电影院安静风拥抱胡子盆栽派对亲吻病毒热老虎老虎玫瑰融化攀爬僵尸鸟火水雪电月亮星
*Crypto secrets 

Mnemonic  Seed Phrase (12-24 words), Private Key, Wallet Address Private Key, http:wallet.dat file, Keystore JSON, Passphrase, API Secret for Binance Coinbase, Webhook Secret, RPC URL with key (Infura - Alchemy key inside), .env with WALLET_PRIVATE_KEY            Z

  developers crypto:

.  *Docker  Kubernetes Secrets* - hardcoded in http:docker-compose.yml
.  *Git History* -  it now but it still exists in old commits
.  *Screenshots  Logs* - http:console.log that prints tokens *Backup Files* - .env.bak, config_old.json         🤣$۝&DL%*@ ۞Ω    ⁸   ndjfkfcdsjhgⵉⵖⵜ~ትግርኛ:mhاي دلقتيㅤ‍‍‍‍⁠ㅤ‌⁠ㅤ⁠⁠‌‍‍‌⁠ㅤ‌ㅤㅤ⁠‍ㅤ‍‌‌⁠‌‌⁠‍‍ㅤ‍ㅤㅤ‍‍‍⁠⁠ㅤ‌ㅤ‌‍⁠‍‌‍‌ㅤ⁠⁠⁠‍‌‍‍‌ㅤㅤ⁠⁠ㅤ‍‍⁠‌ㅤ⁠⁠ㅤ‍ㅤ‌⁠ㅤ‌‍⁠⁠ㅤ⁠ㅤ⁠‍‍‌‌⁠ㅤ⁠‍‌‌⁠ㅤㅤ‍‌‍ㅤ⁠‌ㅤ⁠ㅤ⁠ㅤㅤ‌⁠⁠ㅤ‌‍⁠⁠‌‌⁠‌‍‍‍‍‌‍ㅤㅤ‍ㅤ‌ㅤ⁠⁠⁠ㅤㅤ⁠‌‌‌‍‍⁠⁠‍يااااااااه يا محمد ياخويا
اخيرا حسستني ان في ناس طبيعية زيي
هنا اكتشفت ان الابلكيشن جامع اكبر عدد ممكن من البنات المعقدة والغير سوية نفسياً

@Wae@#√π×√[^=°♥♠¶∆∆ΩμΠπ♪  هنا البنات عندلف عقل الميه الرجاله عليappداخلين للمعاكسه والصحوبيه مش للجواز,  أخر جمله في البوست 
المفروض تكون أول جمله في البوست ✨️
ياريت يا جماعه لما تبدأوا كلام تقولوا : السلام عليكم ورحمة الله وبركاته 
وحتى لو مقولتوهاش واترد  بيها .. تردوا على السلام بتاع ربنا !
وَ إِذا حُيِّيتُمْ بِتَحِيَّةٍ فَحَيُّوا بِأَحْسَنَ مِنْها أَوْ رُدُّوها إِنَّ اللَّهَ كانَ عَلى‏ كُلِّ شَيْ‏ءٍ حَسِيباً 

شكلكوا بيبقى وحش أوي بجد لما أرد بسلام وانتوا متشوفوش ده وتردوا على باقي الكلام !!!
✨️ عيب بجد يا كبار يا واعيين ✨️

في مره اتصدرت مع واحد وقولتله مردتش عالسلام ليه ؟ قالي رديت في سري 😅💔
طيب ومردتش في سرك ليه على باقي الكلام ؟؟؟!

واحد تاني قالي : أنا مش جورج والله !
طيب ما تقول لنفسك انك مش جورج 😅💔بالنسبة لقطع الحوار فجأه 
سعات مش بتكون مقصوده خالص ف ممكن تجرب توضح للشخص ان دي حاجه مهمه بالنسبالك وبتفرق معاك ( بس بدون ضغط )

طيب سعات برضو بتكون لسه بتتعرف عالشخص بقالك يومين تلاته أو أسبوع ف هو مش في دماغه يستأذنك عشان ممكن لسه مبقتش في دماغه بأهمية كبيره أو لعلاقة جاده وحقيقية ف اللي هو لسه مع الوقت ده هيكون موجود بينكم .. تقدير لبعض واعتذار لو حد رايح يعمل حاجه 

لكن لو حد  ده مش مقبول نهائي و حد مش مهتم أو مش  مجانين 
اعرعرعرعرع يمكن دكتوره اسنان وهتعملك تقويم ابسط يعم ابسط 😂هذه من أخلاقيات الناس التي تلقت تربية جيدة حقيقية. لذلك فأن أي شخص هو يعكس تربيته التي نشأ عليها في بيت أهله وبين أسرته وكيف أن أبواه يعاملوه ويتعاملون مع بعضهم البعض. سبحان الله قد تكون أنسان محترم ولكن تصادف شخص غير محترم يتعامل معكَ. لذلك لو حصل معك مثل هذا الأمر برأيي الشخصي فوت مرة واحدة ربما يكون بها شيء  الأمر مرة أخرى لاتكمل في علاقة التعارف مع الشخص الآخر لأنه لايناسبك لاشكلاً ولاطباعاً ولاتربيتاً. وشكراً. تحياتي🎊انا فى حد كلمنى لمده اسبوع وفجاه قطع كلام لوحده فضلت خمس ايام فاكره عنده ظروف ولا حاجه لانه قال  فعلا فى ايه اختفى حتى ماعملش بلوك ولا إلغاء تطابق حتى👽بص يا استاذه محمد اغلب فعلا بس فكره ان كل بيفكر فيه رد فعل كل بيفكر في حاجات حصلت  هنا مفيش اغلب هنا للاسف محدش بيقدر ظروف أو حد يكون بيكلمك يقفل أو حد ليحدد شروط طالما فيه تحديد شروط اللي دخلك هنا💯تقريبا في دي المشكله الاساسيه🙄A beautif الطرف التاني .. 
لو اضطريت تقطع فجاءة -كلنا عندنا ظروف-ترجع تعتذر وتعرف الطرف التاني ايه اضطرك تعمل كدة
لما الي قصادك يستاذنك ، تقوله اتفضل فورا بدون ماتسال ، مين وهاتعمل ايه ؟
لما تحس انه يقفل الكلام سيبه براحته ماتزنش ولا تلح عليه
لما تبدا كلام تقول السلام عليكم 
#انامفتقد جدا ده _هناㅤ⁠⁠⁠ㅤ‌⁠‍‌‌‌‍‌ㅤ⁠‍‍⁠⁠⁠⁠⁠‌‌ㅤㅤ⁠⁠‌ㅤ⁠‍‌‍‌⁠ㅤ⁠‌ㅤ‍⁠ㅤ‍‌‌‌⁠‌⁠⁠‍ㅤ‍‍‌⁠‍‍‍‌⁠⁠‌ㅤ‍⁠ㅤ⁠ㅤ‌⁠‌‌‌ㅤㅤ‌ㅤ‌ㅤㅤㅤ‍ㅤ‌‍‌⁠ㅤ‌‌‌‌ㅤㅤ‍‌‌⁠‍ㅤ‍⁠⁠⁠‍⁠ㅤㅤ‍‌⁠‍‌‌ㅤㅤ‍‌‍⁠‌‌‍‌⁠ㅤ‍‌⁠‌‌‌‌‍‍⁠‍‍‌⁠⁠‌‍⁠‍‍⁠‌⁠‍⁠‌ㅤㅤ‌‌ㅤ‌ㅤㅤㅤ⁠⁠‌⁠‍⁠‍ㅤㅤ‌‌‌‍‌‌ㅤ⁠⁠⁠‍ㅤㅤ‌⁠‌‍⁠‍ㅤ‍⁠ㅤㅤ⁠⁠‌‍‍ㅤ‍⁠‌‍‌‌‍‌ㅤ⁠ㅤ‌‍⁠⁠‌ㅤ‍‌ㅤ⁠ㅤ⁠ㅤ‌⁠‍‌ㅤ‌‍‍‌‍ㅤㅤㅤ⁠‌‍ㅤㅤ‍⁠‌ㅤ⁠ㅤ‍ㅤ‌ㅤ‌‍⁠‍ㅤㅤ‌‌⁠⁠‍⁠‍⁠‍‌ㅤㅤ⁠ㅤ‌⁠‍⁠ㅤ⁠‍‍⁠⁠⁠⁠‍‍‍ㅤ⁠‌ㅤ‍‍‍‌⁠⁠⁠‍⁠ㅤ‌‌ㅤ‌‌‌ㅤ⁠⁠⁠⁠‍ㅤㅤ‌‌⁠‍‍ㅤㅤㅤㅤ‌‍⁠‍‍⁠⁠ㅤ‌‌‌⁠ㅤ‌⁠‌‌‍ㅤ⁠⁠‍‍⁠ㅤㅤ‍‌‌ㅤㅤㅤ‌‌⁠⁠⁠⁠⁠‍‍ㅤ⁠‌‍‌‌‍ㅤ‍ㅤ‌⁠⁠ㅤ‌ㅤ‍ㅤ‌⁠‍⁠‌ㅤㅤㅤ‌⁠ㅤㅤ‍⁠‌‌⁠‌ㅤㅤ‍⁠ㅤㅤ‌ㅤ‍‌‍⁠⁠‍‌‌⁠‌‌‌‌ㅤ⁠‌‌‌⁠⁠ㅤㅤㅤ‌ㅤ⁠‌‌‌ㅤ‌‌⁠‍‍ㅤ‌⁠‌‍ㅤㅤ‌‍ㅤ‍⁠‌ㅤ‍⁠‍⁠‌‍‍‍‍‍ㅤ⁠‌‌‌⁠⁠⁠⁠‌‍ㅤ‍ㅤ‌⁠⁠‌ㅤ⁠‍⁠‍‍‍⁠‍‍ㅤ‌‍‍⁠‌‍‍‍‍ㅤ⁠‍⁠ㅤㅤ‍‌‌⁠‍‍⁠⁠‍‌⁠ㅤ⁠⁠‍‍‌‌⁠⁠⁠⁠⁠‌‌‍ㅤ⁠⁠ㅤ‌ㅤ‌‍‍‍⁠‍⁠ㅤ⁠⁠⁠‌‍⁠‍‍‍‌ㅤㅤ‍ㅤㅤ⁠‍‌‍‌⁠‌ㅤ‌ㅤ‌‍‍ㅤ‍ㅤ‍‍‍ㅤㅤㅤ‌ㅤ⁠⁠⁠⁠‌‌‌ㅤ‌‍‌ㅤ⁠‌⁠ㅤ⁠ㅤ⁠‌‍⁠‌‌⁠‌‌⁠‌‌‌⁠‌‌ㅤ‌⁠‌‍ㅤ⁠‌‌⁠⁠⁠ㅤ⁠‍ㅤ⁠‌‌‍‍⁠ㅤ⁠⁠‌⁠ㅤㅤ⁠⁠‍‌‍‍‌⁠⁠‍‌⁠ㅤㅤ‌‌‍⁠‌‍‍‌ㅤ‌‌‌ㅤ‍⁠⁠‌‌‌ㅤ⁠‌ㅤ⁠‍ㅤ‌‌⁠emailㅤ⁠⁠‍‍⁠ㅤ‌ㅤ‌⁠ㅤㅤ‌ㅤ⁠ㅤ⁠⁠‍ㅤ‍ㅤㅤ⁠⁠⁠ㅤ‍ㅤ‍‌ㅤ⁠‍ㅤ‌⁠ㅤ⁠ㅤ⁠‍ㅤㅤㅤ‍‍‍⁠‌⁠‌‌‌⁠‌⁠‌ㅤ⁠‌‌‍‍‌‌⁠‍⁠⁠‍‍‍⁠‍ㅤ‍‌⁠ㅤㅤ‍‍⁠ㅤㅤ‍ㅤ‌ㅤㅤ⁠‍ㅤ‍‌ㅤ‍‍‌ㅤ‍‌ㅤ‌‍⁠⁠‍⁠‌ㅤ‍‌⁠ㅤ‍‌‌‍‍ㅤㅤ‌ㅤ⁠‌ㅤ‌‍ㅤ‍⁠‍‌‍⁠ㅤ‍ㅤ‌ㅤ‍⁠ㅤ‌ㅤ‌‍‌‍ㅤ⁠ㅤㅤㅤ‍‍‍‍‍ㅤ⁠‌‌‍ㅤㅤ⁠‌‌‍ㅤ‌‍ㅤ⁠‍‍‌⁠ㅤ⁠‍ㅤㅤ⁠ㅤ‌‌‍‍‍⁠‌‌⁠‍‍⁠ㅤ‍ㅤ‌ㅤㅤ‍⁠‌‌‍ㅤ⁠‍ㅤㅤㅤ‍ㅤ‍‌‍‌⁠ㅤ⁠ㅤㅤ‌‍‌‌‍‌⁠‍ㅤ‍‌‌ㅤ⁠⁠⁠‍⁠‌⁠ㅤㅤ⁠ㅤㅤㅤ⁠⁠ㅤㅤ‍ㅤ⁠ㅤㅤ⁠⁠ㅤ⁠‌⁠⁠⁠ㅤ⁠⁠ㅤ⁠‍⁠⁠⁠⁠‌‍⁠‌ㅤ‌ㅤ‌‍⁠‍ㅤ‍ㅤ‌ㅤ‍ㅤㅤ⁠‍‌ㅤ⁠⁠ㅤ‌ㅤ‌‍‍‍⁠‍⁠ㅤ⁠⁠⁠‌‍⁠‍‍‍‌ㅤㅤ‍ㅤㅤ⁠‍‌‍‌⁠‌ㅤ‌ㅤ‌‍‍ㅤ‍ㅤ‍‍ㅤ‍ㅤ‌ㅤㅤ‍⁠‌‌‍ㅤ⁠‍ㅤㅤㅤ‍ㅤ‍‌‍‌⁠ㅤ⁠ㅤㅤ‌‍‌‌‍‌⁠‍ㅤ‍‌‌ㅤ⁠⁠⁠‍⁠‌⁠ㅤㅤ⁠ㅤㅤㅤ⁠ㅤ"]ㅤ⁠‌⁠⁠⁠ㅤ⁠⁠ㅤ⁠‍⁠⁠⁠⁠‌‍⁠‌ㅤ‌ㅤ‌‍⁠‍ㅤ‍ㅤ‌


SCRIPT_1 = [
    'عربيአማርኛქართულიΕλληνικάગુજરાતીעבריתहिंदी日本語ಕನ್ನಡҚазақша'
    'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя'
    'αβγδεζηθικλμνξοπρστυφχψωΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩ'
    'ℵθΩψΔкѲζσxw۝۞¶§†‡•€¥£¢°™®©√π∫∆∇≠≤≥±×÷≈∞'
    'あいうえおかきくけこさしすせそたちつてとなにぬねのはひふへほまみむめもやゆよらりるれろわをん'
    'アイウエオカキクケコサシスセソタチツテトナニヌネノハヒフヘホマミムメモヤユヨラリルレロワヲン'
    '一二三四五六七八九十百千万亿ワヤ二ヴヶ'
    'אבגדהוזחטיכלמנסעפצקרשת'
]

SCRIPT_2 = ["ا", "ب", "پ", "ت", "ث", "ج", "چ", "ح", "خ", "د", "ذ", "ر", "ز", "ژ", "س", "ش", "ص", "ض", "ط", "ظ", "ع", "غ", "ف", "ق", "ک", "ك", "گ", "ل", "م", "ن", "و", "ه", "ی", "ي", "ة", "ؤ", "ئ", "ء"]

SCRIPT_3  = [
    "ا", "ب", "پ", "ت", "ث", "ج", "چ", "ح", "خ", "د", 
    "ذ", "ر", "ز", "ژ", "س", "ش", "ص", "ض", "ط", "ظ", 
    "ع", "غ", "ف", "ق", "ک", "ك", "گ", "ل", "م", "ن", 
    "و", "ه", "ی", "ي", "ة", "ؤ", "ئ", "ء"
]

EMOJI_POOL_3 = [
    "🎉", "🚀", "🌈", "🍕", "⭐", "🐶", "🐱", "🏠", "📚", "💻", "👯‍♂️", "🍔", "🐻", "🎤",
    "s", "n", "e", "e", "z", "e",
    "👻",
    "熊", "猫", "电", "影", "棕", "榈", "海", "滩", "鸡", "车", "跳", "舞", "向", "日", "葵", "猪", "礼", "物", "手", "机", "自", "行", "车", "青", "蛙",
    "🌸", "公", "园", "戏", "剧", "薯", "条", "握", "手", "雏", "菊", "马", "玫", "瑰", "龙", "电", "影", "电", "视", "西", "装", "玉", "米", "奖", "杯", "靶", "子", "施", "工", "流", "星", "鲸", "鱼", "南", "瓜", "拉", "面", "疯", "狂", "门", "火", "山", "鲸", "鱼", "圣", "诞", "巧", "克", "力", "安", "静", "香", "烟", "银", "河", "鱼",
    "⛩️", "圣", "诞", "老", "人", "棒", "棒", "糖", "流", "口", "水", "禁", "烟", "地", "球", "海", "豚", "烟", "花", "汤", "说", "谎", "旗", "帜", "时", "钟", "龙", "控", "制", "台", "竹", "子", "风", "铃", "墨", "镜", "蛛", "网", "多", "云", "青", "蛙", "摩", "天", "轮", "毕", "业", "游", "戏", "手", "柄", "下", "雨", "仓", "鼠", "过", "山", "车", "勋", "章", "兴", "奋", "厕", "所", "太", "阳", "兔", "子",
    "🎋", "竹", "子", "淋", "浴", "狼", "钓", "鱼", "怀", "疑", "鼻", "子", "电", "影", "院", "安", "静", "风", "拥", "抱", "胡", "子", "盆", "栽", "派", "对", "亲", "吻", "病", "毒", "热", "老", "虎", "老", "虎", "玫", "瑰", "融", "化", "攀", "爬", "僵", "尸", "鸟", "火", "水", "雪", "电", "月", "亮", "星",
    "🫧", "🦶", "🦶", "🪶", "🦥", "🦦", "🦥", "🦬", "🦣", "🪼",
    "🧿", "🪩", "🪽", "🫀", "🫁", "🫦", "🫅", "🐍", "💻", "🛜", "🐍", "🧬", "🪢", "🎷", "🧶", "🪫", "🧮", "🐦", "⬛", "🦜", "🐦", "🦁", "🦍", "🐒", "🦨", "🦡", "🦔", "🐔", "🦢", "🐋", "🐙", "🦑", "🦐", "🦞", "🦀", "🐍", "🦔", "🐠", "🦢", "🐚", "🐌", "🐞", "🐝", "🕷️", "🐛", "🦋", "🐾", "🍊", "🍑", "🍉", "🌶️", "🍅", "🍅", "🍒", "🍓", "🥕", "🥭", "🥒", "🥒", "🫐", "🍇", "🌰", "🥫", "🥫", "🍣", "🥩", "🍗", "🌯", "🍕", "🍲", "🍡", "🍥", "🪔", "🍣", "🍤", "🔪", "🛟",
    "Δ", "Δ", "∇", "∇", "∇", "∀", "ℛ", "∀", "ℛ", "∇", "℧", "⊥", "⊥", "ℑ", "♠", "♣", "∓", "∓", "♀", "♂", "⊖", "⊕", "Θ", "Θ", "⊕", "⊘", "⊖", "♂", "♀", "⊘", "♂", "♀"
]

SCRIPT_4 = [
    "ह", "ि", "ं", "द", "ी", "日", "本", "語", "ಕ", "ನ್ನ", "ಡ", "Қ", "а", "з", "а", "қ", "ш", "а", "ע", "ב", "ר", "י", "ת", "አ", "ማ", "ር", "ኛ", "ქ", "ა", "რ", "თ", "უ", "ლ", "ი", "Ε", "λ", "λ", "η", "ν", "ι", "κ", "ά", "ગ", "ુ", "જ", "ર", "ા", "ત", "ી", "ع", "ر", "ب", "ي",
    "А", "Б", "В", "Г", "Д", "Е", "Ё", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я",
    "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ы", "ь", "э", "ю", "я",
    "α", "β", "γ", "δ", "ε", "ζ", "η", "θ", "ι", "κ", "λ", "μ", "ν", "ξ", "ο", "π", "ρ", "σ", "τ", "υ", "φ", "χ", "ψ", "ω", "Α", "Β", "Γ", "Δ", "Ε", "Ζ", "Η", "Θ", "Ι", "Κ", "Λ", "Μ", "Ν", "Ξ", "Ο", "Π", "Ρ", "Σ", "Τ", "Υ", "Φ", "Χ", "Ψ", "Ω",
    "ϰ", "θ", "Ω", "ψ", "Δ", "κ", "Θ", "ζ", "σ", "χ", "w", "◯", "☉", "◍", "ʭ", "§", "†", "‡", "·", "€", "¥", "£", "¢", "°", "™", "®", "©", "√", "π", "∫", "Δ", "∇", "≠", "≤", "≥"
]